ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/SYSCTL_1.0.xml
    <register id="SYSCTL_NMIISET" width="32" offset="0x1070" description="NMI interrupt set">
        <bitfield id="WWDT1" description="Watch Dog 0 Fault" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMDED" description="SRAM Double Error Detect" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORLVL" description="Set the BORLVL NMI" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h hs no effect"/>
            <bitenum id="SET" value="0x1" description="Set interrupt"/>
        </bitfield>
        <bitfield id="FLASHDED" description="Flash Double Error Detect" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="WWDT0" description="Watch Dog 0 Fault" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFCLKFAIL" description="LFXT-EXLF Monitor Fail" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="SET" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_NMIICLR" width="32" offset="0x1078" description="NMI interrupt clear">
        <bitfield id="WWDT1" description="Watch Dog 0 Fault" begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="SRAMDED" description="SRAM Double Error Detect" begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="BORLVL" description="Clr the BORLVL NMI" begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description="Writing 0h hs no effect"/>
            <bitenum id="CLR" value="0x1" description="Clear interrupt"/>
        </bitfield>
        <bitfield id="FLASHDED" description="Flash Double Error Detect" begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="WWDT0" description="Watch Dog 0 Fault" begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
        <bitfield id="LFCLKFAIL" description="LFXT-EXLF Monitor Fail" begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="NO_EFFECT" value="0x0" description=""/>
            <bitenum id="CLR" value="0x1" description=""/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSOSCCFG" width="32" offset="0x1100" description="SYSOSC configuration">
        <bitfield id="USE4MHZSTOP" description="USE4MHZSTOP sets the SYSOSC stop mode frequency policy.  When entering STOP mode, the SYSOSC frequency may be automatically switched to 4MHz to reduce SYSOSC power consumption." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Do not gear shift the SYSOSC to 4MHz in STOP mode"/>
            <bitenum id="ENABLE" value="0x1" description="Gear shift SYSOSC to 4MHz in STOP mode"/>
        </bitfield>
        <bitfield id="DISABLESTOP" description="DISABLESTOP sets the SYSOSC stop mode enable/disable policy.  When operating in STOP mode, the SYSOSC may be automatically disabled.  When set, ULPCLK will run from LFCLK in STOP mode and SYSOSC will be disabled to reduce power consumption." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Do not disable SYSOSC in STOP mode"/>
            <bitenum id="ENABLE" value="0x1" description="Disable SYSOSC in STOP mode and source ULPCLK from LFCLK"/>
        </bitfield>
        <bitfield id="BLOCKASYNCALL" description="BLOCKASYNCALL may be used to mask block all asynchronous fast clock requests, preventing hardware from dynamically changing the active clock configuration when operating in a given mode." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Asynchronous fast clock requests are controlled by the requesting peripheral"/>
            <bitenum id="ENABLE" value="0x1" description="All asynchronous fast clock requests are blocked"/>
        </bitfield>
        <bitfield id="DISABLE" description="DISABLE sets the SYSOSC enable/disable policy.  SYSOSC may be powered off in RUN, SLEEP, and STOP modes to reduce power consumption.  When SYSOSC is disabled, MCLK and ULPCLK are sourced from LFCLK." begin="10" end="10" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Do not disable SYSOSC"/>
            <bitenum id="ENABLE" value="0x1" description="Disable SYSOSC immediately and source MCLK and ULPCLK from LFCLK"/>
        </bitfield>
        <bitfield id="FASTCPUEVENT" description="FASTCPUEVENT may be used to assert a fast clock request when an interrupt is asserted to the CPU, reducing interrupt latency." begin="17" end="17" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="An interrupt to the CPU will not assert a fast clock request"/>
            <bitenum id="ENABLE" value="0x1" description="An interrupt to the CPU will assert a fast clock request"/>
        </bitfield>
        <bitfield id="FREQ" description="Target operating frequency for the system oscillator (SYSOSC)" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="SYSOSCBASE" value="0x0" description="Base frequency (32MHz)"/>
            <bitenum id="SYSOSC4M" value="0x1" description="Low frequency (4MHz)"/>
            <bitenum id="SYSOSCUSER" value="0x2" description="User-trimmed frequency (16 or 24 MHz)"/>
        </bitfield>
    </register>
    <register id="SYSCTL_MCLKCFG" width="32" offset="0x1104" description="Main clock (MCLK) configuration">
        <bitfield id="USEMFTICK" description="USEMFTICK specifies whether the 4MHz constant-rate clock (MFCLK) to peripherals is enabled or disabled.  When enabled, MDIV must be disabled (set to 0h=/1)." begin="12" end="12" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The 4MHz rate MFCLK to peripherals is enabled"/>
            <bitenum id="ENABLE" value="0x1" description="The 4MHz rate MFCLK to peripherals is enabled."/>
        </bitfield>
        <bitfield id="MDIV" description="MDIV may be used to divide the MCLK frequency when MCLK is sourced from SYSOSC.  MDIV=0h corresponds to /1 (no divider).  MDIV=1h corresponds to /2 (divide-by-2).  MDIV=Fh corresponds to /16 (divide-by-16).  MDIV may be set between /1 and /16 on an integer basis." begin="3" end="0" width="4" rwaccess="R/W">
        </bitfield>
        <bitfield id="USEHSCLK" description="USEHSCLK, together with USELFCLK, sets the MCLK source policy.  Set USEHSCLK to use HSCLK (HFCLK or SYSPLL) as the MCLK source in RUN and SLEEP modes." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="MCLK will not use the high speed clock (HSCLK)"/>
            <bitenum id="ENABLE" value="0x1" description="MCLK will use the high speed clock (HSCLK) in RUN and SLEEP mode"/>
        </bitfield>
        <bitfield id="USELFCLK" description="USELFCLK sets the MCLK source policy.  Set USELFCLK to use LFCLK as the MCLK source.  Note that setting USELFCLK does not disable SYSOSC, and SYSOSC remains available for direct use by analog modules." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="MCLK will not use the low frequency clock (LFCLK)"/>
            <bitenum id="ENABLE" value="0x1" description="MCLK will use the low frequency clock (LFCLK)"/>
        </bitfield>
        <bitfield id="STOPCLKSTBY" description="STOPCLKSTBY sets the STANDBY mode policy (STANDBY0 or STANDBY1).  When set, ULPCLK and LFCLK are disabled to all peripherals in STANDBY mode, with the exception of TIMG0 and TIMG1 which continue to run.  Wake-up is only possible via an asynchronous fast clock request." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="ULPCLK/LFCLK runs to all PD0 peripherals in STANDBY mode"/>
            <bitenum id="ENABLE" value="0x1" description="ULPCLK/LFCLK is disabled to all peripherals in STANDBY mode except TIMG0 and TIMG1"/>
        </bitfield>
        <bitfield id="FLASHWAIT" description="FLASHWAIT specifies the number of flash wait states when MCLK is sourced from HSCLK.  FLASHWAIT has no effect when MCLK is sourced from SYSOSC or LFCLK." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="WAIT0" value="0x0" description="No flash wait states are applied"/>
            <bitenum id="WAIT1" value="0x1" description="One flash wait state is applied"/>
            <bitenum id="WAIT2" value="0x2" description="2 flash wait states are applied"/>
        </bitfield>
        <bitfield id="MCLKDEADCHK" description="MCLKDEADCHK enables or disables the continuous MCLK dead check monitor.  LFCLK must be running before MCLKDEADCHK is enabled." begin="22" end="22" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The MCLK dead check monitor is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="The MCLK dead check monitor is enabled"/>
        </bitfield>
        <bitfield id="UDIV" description="UDIV specifies the ULPCLK divider when MCLK is sourced from HSCLK.  UDIV has no effect when MCLK is sourced from SYSOSC or LFCLK." begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="NODIVIDE" value="0x0" description="ULPCLK is not divided and is equal to MCLK"/>
            <bitenum id="DIVIDE2" value="0x1" description="ULPCLK is MCLK/2 (divided-by-2)"/>
        </bitfield>
    </register>
    <register id="SYSCTL_HSCLKEN" width="32" offset="0x1108" description="High-speed clock (HSCLK) source enable/disable">
        <bitfield id="HFXTEN" description="HFXTEN enables or disables the high frequency crystal oscillator (HFXT)." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable the HFXT"/>
            <bitenum id="ENABLE" value="0x1" description="Enable the HFXT"/>
        </bitfield>
        <bitfield id="USEEXTHFCLK" description="USEEXTHFCLK selects the HFCLK_IN digital clock input to be the source for HFCLK.  When disabled, HFXT is the HFCLK source and HFXTEN may be set.  Do not set HFXTEN and USEEXTHFCLK simultaneously." begin="16" end="16" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Use HFXT as the HFCLK source"/>
            <bitenum id="ENABLE" value="0x1" description="Use the HFCLK_IN digital clock input as the HFCLK source"/>
        </bitfield>
        <bitfield id="SYSPLLEN" description="SYSPLLEN enables or disables the system phase-lock loop (SYSPLL)." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable the SYSPLL"/>
            <bitenum id="ENABLE" value="0x1" description="Enable the SYSPLL"/>
        </bitfield>
    </register>
    <register id="SYSCTL_HSCLKCFG" width="32" offset="0x110C" description="High-speed clock (HSCLK) source selection">
        <bitfield id="USBFLL4HSCLK" description="USBFLL4HSCLK selects the USBFLL as High Speed clock source" begin="1" end="1" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="HSCLKSEL" description="HSCLKSEL selects the HSCLK source (SYSPLL or HFCLK)." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SYSPLL" value="0x0" description="HSCLK is sourced from the SYSPLL"/>
            <bitenum id="HFCLKCLK" value="0x1" description="HSCLK is sourced from the HFCLK"/>
        </bitfield>
    </register>
    <register id="SYSCTL_HFCLKCLKCFG" width="32" offset="0x1110" description="High-frequency clock (HFCLK) configuration">
        <bitfield id="HFXTTIME" description="HFXTTIME specifies the HFXT startup time in 64us resolution.  If the HFCLK startup monitor is enabled (HFCLKFLTCHK), HFXT will be checked after this time expires." begin="7" end="0" width="8" rwaccess="R/W">
            <bitenum id="MINSTARTTIME" value="0x0" description="Minimum startup time (approximatly zero)"/>
            <bitenum id="MAXSTARTTIME" value="0xFF" description="Maximum startup time (approximatly 16.32ms)"/>
        </bitfield>
        <bitfield id="HFCLKFLTCHK" description="HFCLKFLTCHK enables or disables the HFCLK startup monitor." begin="28" end="28" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="HFCLK startup is not checked"/>
            <bitenum id="ENABLE" value="0x1" description="HFCLK startup is checked"/>
        </bitfield>
        <bitfield id="HFXTRSEL" description="HFXT Range Select" begin="13" end="12" width="2" rwaccess="R/W">
            <bitenum id="RANGE4TO8" value="0x0" description="4MHz &lt;= HFXT frequency &lt;= 8MHz"/>
            <bitenum id="RANGE8TO16" value="0x1" description="8MHz &lt; HFXT frequency &lt;= 16MHz"/>
            <bitenum id="RANGE16TO32" value="0x2" description="16MHz &lt; HFXT frequency &lt;= 32MHz"/>
            <bitenum id="RANGE32TO48" value="0x3" description="32MHz &lt; HFXT frequency &lt;= 48MHz"/>
        </bitfield>
    </register>
    <register id="SYSCTL_LFCLKCFG" width="32" offset="0x1114" description="Low frequency crystal oscillator (LFXT) configuration">
        <bitfield id="XT1DRIVE" description="XT1DRIVE selects the low frequency crystal oscillator (LFXT) drive strength." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="LOWESTDRV" value="0x0" description="Lowest drive and current"/>
            <bitenum id="LOWERDRV" value="0x1" description="Lower drive and current"/>
            <bitenum id="HIGHERDRV" value="0x2" description="Higher drive and current"/>
            <bitenum id="HIGHESTDRV" value="0x3" description="Highest drive and current"/>
        </bitfield>
        <bitfield id="MONITOR" description="MONITOR enables or disables the LFCLK monitor, which continuously checks LFXT or LFCLK_IN for a clock stuck fault." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Clock monitor is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Clock monitor is enabled"/>
        </bitfield>
        <bitfield id="LOWCAP" description="LOWCAP controls the low-power LFXT mode.  When the LFXT load capacitance is less than 3pf, LOWCAP may be set for reduced power consumption." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="LFXT low capacitance mode is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="LFXT low capacitance mode is enabled"/>
        </bitfield>
    </register>
