ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/SYSCTL_1.0.xml
    <register id="SYSCTL_SYSPLLCFG0" width="32" offset="0x1120" description="SYSPLL reference and output configuration">
        <bitfield id="ENABLECLK0" description="ENABLECLK0 enables or disables the SYSPLLCLK0 output." begin="4" end="4" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SYSPLLCLK0 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="SYSPLLCLK0 is enabled"/>
        </bitfield>
        <bitfield id="ENABLECLK1" description="ENABLECLK1 enables or disables the SYSPLLCLK1 output." begin="5" end="5" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SYSPLLCLK1 is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="SYSPLLCLK1 is enabled"/>
        </bitfield>
        <bitfield id="RDIVCLK1" description="RDIVCLK1 sets the final divider for the SYSPLLCLK1 output." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="CLK1DIV2" value="0x0" description="SYSPLLCLK1 is divided by 2"/>
            <bitenum id="CLK1DIV4" value="0x1" description="SYSPLLCLK1 is divided by 4"/>
            <bitenum id="CLK1DIV6" value="0x2" description="SYSPLLCLK1 is divided by 6"/>
            <bitenum id="CLK1DIV8" value="0x3" description="SYSPLLCLK1 is divided by 8"/>
            <bitenum id="CLK1DIV10" value="0x4" description="SYSPLLCLK1 is divided by 10"/>
            <bitenum id="CLK1DIV12" value="0x5" description="SYSPLLCLK1 is divided by 12"/>
            <bitenum id="CLK1DIV14" value="0x6" description="SYSPLLCLK1 is divided by 14"/>
            <bitenum id="CLK1DIV16" value="0x7" description="SYSPLLCLK1 is divided by 16"/>
            <bitenum id="CLK1DIV18" value="0x8" description="SYSPLLCLK1 is divided by 18"/>
            <bitenum id="CLK1DIV20" value="0x9" description="SYSPLLCLK1 is divided by 20"/>
            <bitenum id="CLK1DIV22" value="0xA" description="SYSPLLCLK1 is divided by 22"/>
            <bitenum id="CLK1DIV24" value="0xB" description="SYSPLLCLK1 is divided by 24"/>
            <bitenum id="CLK1DIV26" value="0xC" description="SYSPLLCLK1 is divided by 26"/>
            <bitenum id="CLK1DIV28" value="0xD" description="SYSPLLCLK1 is divided by 28"/>
            <bitenum id="CLK1DIV30" value="0xE" description="SYSPLLCLK1 is divided by 30"/>
            <bitenum id="CLK1DIV32" value="0xF" description="SYSPLLCLK1 is divided by 32"/>
        </bitfield>
        <bitfield id="MCLK2XVCO" description="MCLK2XVCO selects the SYSPLL output which is sent to the HSCLK mux for use by MCLK." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="The SYSPLLCLK0 output is sent to the HSCLK mux"/>
            <bitenum id="ENABLE" value="0x1" description="The SYSPLLCLK2X output is sent to the HSCLK mux"/>
        </bitfield>
        <bitfield id="RDIVCLK2X" description="RDIVCLK2X sets the final divider for the SYSPLLCLK2X output." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="CLK2XDIV1" value="0x0" description="SYSPLLCLK1 is divided by 1"/>
            <bitenum id="CLK2XDIV2" value="0x1" description="SYSPLLCLK1 is divided by 2"/>
            <bitenum id="CLK2XDIV3" value="0x2" description="SYSPLLCLK1 is divided by 3"/>
            <bitenum id="CLK2XDIV4" value="0x3" description="SYSPLLCLK1 is divided by 4"/>
            <bitenum id="CLK2XDIV5" value="0x4" description="SYSPLLCLK1 is divided by 5"/>
            <bitenum id="CLK2XDIV6" value="0x5" description="SYSPLLCLK1 is divided by 6"/>
            <bitenum id="CLK2XDIV7" value="0x6" description="SYSPLLCLK1 is divided by 7"/>
            <bitenum id="CLK2XDIV8" value="0x7" description="SYSPLLCLK1 is divided by 8"/>
            <bitenum id="CLK2XDIV9" value="0x8" description="SYSPLLCLK1 is divided by 9"/>
            <bitenum id="CLK2XDIV10" value="0x9" description="SYSPLLCLK1 is divided by 10"/>
            <bitenum id="CLK2XDIV11" value="0xA" description="SYSPLLCLK1 is divided by 11"/>
            <bitenum id="CLK2XDIV12" value="0xB" description="SYSPLLCLK1 is divided by 12"/>
            <bitenum id="CLK2XDIV13" value="0xC" description="SYSPLLCLK1 is divided by 13"/>
            <bitenum id="CLK2XDIV14" value="0xD" description="SYSPLLCLK1 is divided by 14"/>
            <bitenum id="CLK2XDIV15" value="0xE" description="SYSPLLCLK1 is divided by 15"/>
            <bitenum id="CLK2XDIV16" value="0xF" description="SYSPLLCLK1 is divided by 16"/>
        </bitfield>
        <bitfield id="RDIVCLK0" description="RDIVCLK0 sets the final divider for the SYSPLLCLK0 output." begin="11" end="8" width="4" rwaccess="R/W">
            <bitenum id="CLK0DIV2" value="0x0" description="SYSPLLCLK0 is divided by 2"/>
            <bitenum id="CLK0DIV4" value="0x1" description="SYSPLLCLK0 is divided by 4"/>
            <bitenum id="CLK0DIV6" value="0x2" description="SYSPLLCLK0 is divided by 6"/>
            <bitenum id="CLK0DIV8" value="0x3" description="SYSPLLCLK0 is divided by 8"/>
            <bitenum id="CLK0DIV10" value="0x4" description="SYSPLLCLK0 is divided by 10"/>
            <bitenum id="CLK0DIV12" value="0x5" description="SYSPLLCLK0 is divided by 12"/>
            <bitenum id="CLK0DIV14" value="0x6" description="SYSPLLCLK0 is divided by 14"/>
            <bitenum id="CLK0DIV16" value="0x7" description="SYSPLLCLK0 is divided by 16"/>
            <bitenum id="CLK0DIV18" value="0x8" description="SYSPLLCLK0 is divided by 18"/>
            <bitenum id="CLK0DIV20" value="0x9" description="SYSPLLCLK0 is divided by 20"/>
            <bitenum id="CLK0DIV22" value="0xA" description="SYSPLLCLK0 is divided by 22"/>
            <bitenum id="CLK0DIV24" value="0xB" description="SYSPLLCLK0 is divided by 24"/>
            <bitenum id="CLK0DIV26" value="0xC" description="SYSPLLCLK0 is divided by 26"/>
            <bitenum id="CLK0DIV28" value="0xD" description="SYSPLLCLK0 is divided by 28"/>
            <bitenum id="CLK0DIV30" value="0xE" description="SYSPLLCLK0 is divided by 30"/>
            <bitenum id="CLK0DIV32" value="0xF" description="SYSPLLCLK0 is divided by 32"/>
        </bitfield>
        <bitfield id="SYSPLLREF" description="SYSPLLREF selects the system PLL (SYSPLL) reference clock source." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="SYSOSC" value="0x0" description="SYSPLL reference is SYSOSC"/>
            <bitenum id="HFCLK" value="0x1" description="SYSPLL reference is HFCLK"/>
        </bitfield>
        <bitfield id="ENABLECLK2X" description="ENABLECLK2X enables or disables the SYSPLLCLK2X output." begin="6" end="6" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="SYSPLLCLK2X is disabled"/>
            <bitenum id="ENABLE" value="0x1" description="SYSPLLCLK2X is enabled"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLCFG1" width="32" offset="0x1124" description="SYSPLL reference and feedback divider">
        <bitfield id="PDIV" description="PDIV selects the SYSPLL reference clock prescale divider." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="REFDIV1" value="0x0" description="SYSPLLREF is not divided"/>
            <bitenum id="REFDIV2" value="0x1" description="SYSPLLREF is divided by 2"/>
            <bitenum id="REFDIV4" value="0x2" description="SYSPLLREF is divided by 4"/>
            <bitenum id="REFDIV8" value="0x3" description="SYSPLLREF is divided by 8"/>
        </bitfield>
        <bitfield id="QDIV" description="QDIV selects the SYSPLL feedback path divider." begin="14" end="8" width="7" rwaccess="R/W">
            <bitenum id="INVALID" value="0x0" description="Divide-by-one is not a valid QDIV option"/>
            <bitenum id="QDIVMIN" value="0x1" description="Feedback path is divided by 2"/>
            <bitenum id="QDIVMAX" value="0x7E" description="Feedback path is divided by 127 (0x7E)"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLPARAM0" width="32" offset="0x1128" description="SYSPLL PARAM0 (load from FACTORY region)">
        <bitfield id="CPCURRENT" description="Charge pump current" begin="21" end="16" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAPBOVERRIDE" description="CAPBOVERRIDE controls the override for Cap B" begin="31" end="31" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Cap B override disabled"/>
            <bitenum id="ENABLE" value="0x1" description="Cap B override enabled"/>
        </bitfield>
        <bitfield id="STARTTIME" description="Startup time from enable to locked clock, in 1us resolution" begin="5" end="0" width="6" rwaccess="R/W">
        </bitfield>
        <bitfield id="CAPBVAL" description="Override value for Cap B" begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="STARTTIMELP" description="Startup time from low power mode exit to locked clock, in 1us resolution" begin="13" end="8" width="6" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_SYSPLLPARAM1" width="32" offset="0x112C" description="SYSPLL PARAM1 (load from FACTORY region)">
        <bitfield id="LPFCAPA" description="Loop filter Cap A" begin="4" end="0" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="LPFRESC" description="Loop filter Res C" begin="31" end="24" width="8" rwaccess="R/W">
        </bitfield>
        <bitfield id="LPFRESA" description="Loop filter Res A" begin="17" end="8" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="SYSCTL_GENCLKCFG" width="32" offset="0x1138" description="General clock configuration">
        <bitfield id="HFCLK4MFPCLKDIV" description="HFCLK4MFPCLKDIV selects the divider applied to HFCLK when HFCLK is used as the MFPCLK source.  Integer dividers from /1 to /16 may be selected." begin="15" end="12" width="4" rwaccess="R/W">
            <bitenum id="DIV1" value="0x0" description="HFCLK is not divided before being used for MFPCLK"/>
            <bitenum id="DIV2" value="0x1" description="HFCLK is divided by 2 before being used for MFPCLK"/>
            <bitenum id="DIV3" value="0x2" description="HFCLK is divided by 3 before being used for MFPCLK"/>
            <bitenum id="DIV4" value="0x3" description="HFCLK is divided by 4 before being used for MFPCLK"/>
            <bitenum id="DIV5" value="0x4" description="HFCLK is divided by 5 before being used for MFPCLK"/>
            <bitenum id="DIV6" value="0x5" description="HFCLK is divided by 6 before being used for MFPCLK"/>
            <bitenum id="DIV7" value="0x6" description="HFCLK is divided by 7 before being used for MFPCLK"/>
            <bitenum id="DIV8" value="0x7" description="HFCLK is divided by 8 before being used for MFPCLK"/>
            <bitenum id="DIV9" value="0x8" description="HFCLK is divided by 9 before being used for MFPCLK"/>
            <bitenum id="DIV10" value="0x9" description="HFCLK is divided by 10 before being used for MFPCLK"/>
            <bitenum id="DIV11" value="0xA" description="HFCLK is divided by 11 before being used for MFPCLK"/>
            <bitenum id="DIV12" value="0xB" description="HFCLK is divided by 12 before being used for MFPCLK"/>
            <bitenum id="DIV13" value="0xC" description="HFCLK is divided by 13 before being used for MFPCLK"/>
            <bitenum id="DIV14" value="0xD" description="HFCLK is divided by 14 before being used for MFPCLK"/>
            <bitenum id="DIV15" value="0xE" description="HFCLK is divided by 15 before being used for MFPCLK"/>
            <bitenum id="DIV16" value="0xF" description="HFCLK is divided by 16 before being used for MFPCLK"/>
        </bitfield>
        <bitfield id="MFPCLKSRC" description="MFPCLKSRC selects the MFPCLK (middle frequency precision clock) source." begin="9" end="9" width="1" rwaccess="R/W">
            <bitenum id="SYSOSC" value="0x0" description="MFPCLK is sourced from SYSOSC"/>
            <bitenum id="HFCLK" value="0x1" description="MFPCLK is sourced from HFCLK"/>
        </bitfield>
        <bitfield id="CANCLKSRC" description="CANCLKSRC selects the CANCLK source." begin="8" end="8" width="1" rwaccess="R/W">
            <bitenum id="HFCLK" value="0x0" description="CANCLK source is HFCLK"/>
            <bitenum id="SYSPLLOUT1" value="0x1" description="CANCLK source is SYSPLLCLK1"/>
        </bitfield>
        <bitfield id="FCCLFCLKSRC" description="FCCLFCLKSRC selects between SYSTEM LFCLK and EXTERNAL SOURCED LFCLK." begin="29" end="29" width="1" rwaccess="R/W">
        </bitfield>
        <bitfield id="FCCTRIGCNT" description="FCCTRIGCNT specifies the number of trigger clock periods in the trigger window. FCCTRIGCNT=0h (one trigger clock period) up to 1Fh (32 trigger clock periods) may be specified." begin="28" end="24" width="5" rwaccess="R/W">
        </bitfield>
        <bitfield id="ANACPUMPCFG" description="ANACPUMPCFG selects the analog mux charge pump (VBOOST) enable method." begin="23" end="22" width="2" rwaccess="R/W">
            <bitenum id="ONDEMAND" value="0x0" description="VBOOST is enabled on request from a COMP, GPAMP, or OPA"/>
            <bitenum id="ONACTIVE" value="0x1" description="VBOOST is enabled when the device is in RUN or SLEEP mode, or when a COMP/GPAMP/OPA is enabled"/>
            <bitenum id="ONALWAYS" value="0x2" description="VBOOST is always enabled"/>
        </bitfield>
        <bitfield id="FCCTRIGSRC" description="FCCTRIGSRC selects the frequency clock counter (FCC) trigger source." begin="20" end="20" width="1" rwaccess="R/W">
            <bitenum id="EXTPIN" value="0x0" description="FCC trigger is the external pin"/>
            <bitenum id="LFCLK" value="0x1" description="FCC trigger is the LFCLK"/>
        </bitfield>
        <bitfield id="FCCSELCLK" description="FCCSELCLK selectes the frequency clock counter (FCC) clock source." begin="19" end="16" width="4" rwaccess="R/W">
            <bitenum id="MCLK" value="0x0" description="FCC clock is MCLK"/>
            <bitenum id="SYSOSC" value="0x1" description="FCC clock is SYSOSC"/>
            <bitenum id="HFCLK" value="0x2" description="FCC clock is HFCLK"/>
            <bitenum id="EXTCLK" value="0x3" description="FCC clock is the CLK_OUT selection"/>
            <bitenum id="SYSPLLCLK0" value="0x4" description="FCC clock is SYSPLLCLK0"/>
            <bitenum id="SYSPLLCLK1" value="0x5" description="FCC clock is SYSPLLCLK1"/>
            <bitenum id="SYSPLLCLK2X" value="0x6" description="FCC clock is SYSPLLCLK2X"/>
            <bitenum id="FCCIN" value="0x7" description="FCC clock is the FCCIN external input"/>
        </bitfield>
        <bitfield id="FCCLVLTRIG" description="FCCLVLTRIG selects the frequency clock counter (FCC) trigger mode." begin="21" end="21" width="1" rwaccess="R/W">
            <bitenum id="RISE2RISE" value="0x0" description="Rising edge to rising edge triggered"/>
            <bitenum id="LEVEL" value="0x1" description="Level triggered"/>
        </bitfield>
        <bitfield id="EXCLKSRC" description="EXCLKSRC selects the source for the CLK_OUT external clock output block.  ULPCLK and MFPCLK require the CLK_OUT divider (EXCLKDIVEN) to be enabled" begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="SYSOSC" value="0x0" description="CLK_OUT is SYSOSC"/>
            <bitenum id="ULPCLK" value="0x1" description="CLK_OUT is ULPCLK (EXCLKDIVEN must be enabled)"/>
            <bitenum id="LFCLK" value="0x2" description="CLK_OUT is LFCLK"/>
            <bitenum id="MFPCLK" value="0x3" description="CLK_OUT is MFPCLK (EXCLKDIVEN must be enabled)"/>
            <bitenum id="HFCLK" value="0x4" description="CLK_OUT is HFCLK"/>
            <bitenum id="SYSPLLOUT1" value="0x5" description="CLK_OUT is SYSPLLCLK1 (SYSPLLCLK1 must be &lt;=48MHz)"/>
        </bitfield>
        <bitfield id="EXCLKDIVVAL" description="EXCLKDIVVAL selects the divider value for the divider in the CLK_OUT external clock output block." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="DIV2" value="0x0" description="CLK_OUT source is divided by 2"/>
            <bitenum id="DIV4" value="0x1" description="CLK_OUT source is divided by 4"/>
            <bitenum id="DIV6" value="0x2" description="CLK_OUT source is divided by 6"/>
            <bitenum id="DIV8" value="0x3" description="CLK_OUT source is divided by 8"/>
            <bitenum id="DIV10" value="0x4" description="CLK_OUT source is divided by 10"/>
            <bitenum id="DIV12" value="0x5" description="CLK_OUT source is divided by 12"/>
            <bitenum id="DIV14" value="0x6" description="CLK_OUT source is divided by 14"/>
            <bitenum id="DIV16" value="0x7" description="CLK_OUT source is divided by 16"/>
        </bitfield>
        <bitfield id="EXCLKDIVEN" description="EXCLKDIVEN enables or disables the divider function of the CLK_OUT external clock output block." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="PASSTHRU" value="0x0" description="CLock divider is disabled (passthrough, EXCLKDIVVAL is not applied)"/>
            <bitenum id="ENABLE" value="0x1" description="Clock divider is enabled (EXCLKDIVVAL is applied)"/>
        </bitfield>
    </register>
