ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0gx218_gx207/SYSCTL_1.0.xml
    <register id="SYSCTL_DEDERRADDR" width="32" offset="0x120C" description="Memory DED Address">
    </register>
    <register id="SYSCTL_RSTCAUSE" width="32" offset="0x1220" description="Reset cause">
        <bitfield id="ID" description="ID is a read-to-clear field which indicates the lowest level reset cause since the last read." begin="4" end="0" width="5" rwaccess="R">
            <bitenum id="NORST" value="0x0" description="No reset since last read"/>
            <bitenum id="PORHWFAIL" value="0x1" description="POR- violation, SHUTDNSTOREx or PMU trim parity fault"/>
            <bitenum id="POREXNRST" value="0x2" description="NRST triggered POR (&gt;1s hold)"/>
            <bitenum id="PORSW" value="0x3" description="Software triggered POR"/>
            <bitenum id="BORSUPPLY" value="0x4" description="BOR0- violation"/>
            <bitenum id="BORWAKESHUTDN" value="0x5" description="SHUTDOWN mode exit"/>
            <bitenum id="BOOTNONPMUPARITY" value="0x8" description="Non-PMU trim parity fault"/>
            <bitenum id="BOOTCLKFAIL" value="0x9" description="Fatal clock failure"/>
            <bitenum id="BOOTEXNRST" value="0xC" description="NRST triggered BOOTRST (&lt;1s hold)"/>
            <bitenum id="BOOTSW" value="0xD" description="Software triggered BOOTRST"/>
            <bitenum id="BOOTWWDT0" value="0xE" description="WWDT0 violation"/>
            <bitenum id="SYSBSLEXIT" value="0x10" description="BSL exit"/>
            <bitenum id="SYSBSLENTRY" value="0x11" description="BSL entry"/>
            <bitenum id="SYSWWDT1" value="0x13" description="WWDT1 violation"/>
            <bitenum id="SYSFLASHECC" value="0x14" description="Flash uncorrectable ECC error"/>
            <bitenum id="SYSCPULOCK" value="0x15" description="CPULOCK violation"/>
            <bitenum id="SYSDBG" value="0x1A" description="Debug triggered SYSRST"/>
            <bitenum id="SYSSW" value="0x1B" description="Software triggered SYSRST"/>
            <bitenum id="CPUDBG" value="0x1C" description="Debug triggered CPURST"/>
            <bitenum id="CPUSW" value="0x1D" description="Software triggered CPURST"/>
        </bitfield>
    </register>
    <register id="SYSCTL_RESETLEVEL" width="32" offset="0x1300" description="Reset level for application-triggered reset command">
        <bitfield id="LEVEL" description="LEVEL is used to specify the type of reset to be issued when RESETCMD is set to generate a software triggered reset." begin="2" end="0" width="3" rwaccess="R/W">
            <bitenum id="CPU" value="0x0" description="Issue a SYSRST (CPU plus peripherals only)"/>
            <bitenum id="BOOT" value="0x1" description="Issue a BOOTRST (CPU, peripherals, and boot configuration routine)"/>
            <bitenum id="BOOTLOADERENTRY" value="0x2" description="Issue a SYSRST and enter the boot strap loader (BSL)"/>
            <bitenum id="POR" value="0x3" description="Issue a power-on reset (POR)"/>
            <bitenum id="BOOTLOADEREXIT" value="0x4" description="Issue a SYSRST and exit the boot strap loader (BSL)"/>
        </bitfield>
    </register>
    <register id="SYSCTL_RESETCMD" width="32" offset="0x1304" description="Execute an application-triggered reset command">
        <bitfield id="GO" description="Execute the reset specified in RESETLEVEL.LEVEL.  Must be written together with the KEY." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Issue reset"/>
        </bitfield>
    </register>
    <register id="SYSCTL_BORTHRESHOLD" width="32" offset="0x1308" description="BOR threshold selection">
        <bitfield id="LEVEL" description="LEVEL specifies the desired BOR threshold and BOR mode." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="BORMIN" value="0x0" description="Default minimum threshold; a BOR0- violation triggers a BOR"/>
            <bitenum id="BORLEVEL1" value="0x1" description="A BOR1- violation generates a BORLVL interrupt"/>
            <bitenum id="BORLEVEL2" value="0x2" description="A BOR2- violation generates a BORLVL interrupt"/>
            <bitenum id="BORLEVEL3" value="0x3" description="A BOR3- violation generates a BORLVL interrupt"/>
        </bitfield>
    </register>
    <register id="SYSCTL_BORCLRCMD" width="32" offset="0x130C" description="Set the BOR threshold">
        <bitfield id="GO" description="GO clears any prior BOR violation status indications and attempts to change the active BOR mode to that specified in the LEVEL field of the BORTHRESHOLD register." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Issue clear"/>
        </bitfield>
    </register>
    <register id="SYSCTL_SYSOSCFCLCTL" width="32" offset="0x1310" description="SYSOSC frequency correction loop (FCL) ROSC enable">
        <bitfield id="SETUSEFCL" description="Set SETUSEFCL to enable the frequency correction loop in SYSOSC.  Once enabled, this state is locked until the next BOOTRST." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Enable the SYSOSC FCL"/>
        </bitfield>
        <bitfield id="SETUSEEXRES" description="Set SETUSEEXRES to specify that an external resistor will be used for the FCL.  An appropriate resistor must be populated on the ROSC pin.  This state is locked until the next BOOTRST." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Enable the SYSOSC external Resistor"/>
        </bitfield>
    </register>
    <register id="SYSCTL_LFXTCTL" width="32" offset="0x1314" description="LFXT and LFCLK control">
        <bitfield id="SETUSELFXT" description="Set SETUSELFXT to switch LFCLK to LFXT.  Once set, SETUSELFXT remains set until the next BOOTRST." begin="1" end="1" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description=""/>
            <bitenum id="TRUE" value="0x1" description="Use LFXT as the LFCLK source"/>
        </bitfield>
        <bitfield id="STARTLFXT" description="Set STARTLFXT to start the low frequency crystal oscillator (LFXT).  Once set, STARTLFXT remains set until the next BOOTRST." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="FALSE" value="0x0" description="LFXT not started"/>
            <bitenum id="TRUE" value="0x1" description="Start LFXT"/>
        </bitfield>
    </register>
    <register id="SYSCTL_EXLFCTL" width="32" offset="0x1318" description="LFCLK_IN and LFCLK control">
        <bitfield id="SETUSEEXLF" description="Set SETUSEEXLF to switch LFCLK to the LFCLK_IN digital clock input.  Once set, SETUSEEXLF remains set until the next BOOTRST." begin="0" end="0" width="1" rwaccess="R/W">
            <bitenum id="TRUE" value="0x1" description="Use LFCLK_IN as the LFCLK source"/>
        </bitfield>
    </register>
